"""На числовой прямой даны два отрезка: P = [17; 58] и Q = [29; 80]. Укажите наименьшую возможную длину такого отрезка A, что логическое выражение
(x∈P)→(((x∈Q)∧¬(x∈A))→¬(x∈P))
 истинно (т.е. принимает значение 1) при любом значении переменной х."""


def f20905(x, a1, a2):
    p = 17 <= x <= 58
    q = 29 <= x <= 80
    a = a1 <= x <= a2
    return (p) <= (((q) and (not a)) <= (not p))


d = []
for x in 17, 58, 29, 80:
    d.append(x)
    d.append(x - 0.01)
    d.append(x + 0.01)
m = []
for a1 in d:
    for a2 in d:
        if a2 >= a1 and all(f20905(x, a1, a2) == 1 for x in d):
            m.append(a2 - a1)
print(m)
print(min(m))

'''На числовой прямой даны два отрезка: 
С=[48;94] и J=[83;100]. Укажите наибольшую возможную длину такого отрезка 
A, для которого логическое выражение
¬((x∈C)∨(x∈J))→¬(x∈A)
истинно (т.е. принимает значение 1) при любом значении переменной x?'''
def f18595(x,a1,a2):
    c=48<=x<=94
    j=83<=x<=100
    a=a1<=x<=a2
    return (not(c or j)) <= (not a)
d=[]
for x in 48,94,83,100:
    d.append(x)
    d.append(x-0.01)
    d.append(x+0.01)
m=[]
for a1 in d:
    for a2 in d:
        if a2>a1 and all(f18595(x, a1,a2)==1 for x in d):
            m.append(a2-a1)
print(max(m))
