"""Музыкальный фрагмент был записан в формате моно, оцифрован и сохранён
в виде файла без использования сжатия данных. Размер полученного файла –
28 Мбайт. Затем тот же музыкальный фрагмент был записан повторно
в формате стерео (двухканальная запись) и оцифрован с разрешением
в 3,5 раза выше и частотой дискретизации в 2 раза меньше, чем в первый раз.
Сжатие данных не производилось. Укажите размер полученного при
повторной записи файла в Мбайт. В ответе запишите только целое число,
единицу измерения писать не нужно.
Ответ: ___________________________."""
print((28*2*3.5)/2)